In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('archive/basic2.csv')

df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [3]:
df['Date'] = pd.to_datetime(df['Date'])
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day
df['dayofweek'] = df['Date'].dt.dayofweek

In [4]:
df.head()

        Date     Sales      PV      UV  Events  year  month  day  dayofweek
0 2022-01-01  22711525  397349  4421.0       1  2022      1    1          5
1 2022-01-02     36779    3969  2289.0       0  2022      1    2          6
2 2022-01-03  13943875  373890     NaN       1  2022      1    3          0
3 2022-01-04   8088593  142054  2157.0       0  2022      1    4          1
4 2022-01-05   2395374  190684     NaN       0  2022      1    5          2

In [5]:
def event_sales(x) :
    if x['Events'] == 1 :
        x['Sales2'] = x['Sales'] * 0.8
    else :
        x['Sales2'] = x['Sales']

    return x

df = df.apply(lambda x : event_sales(x), axis=1)

df.head()

,Date,Sales,PV,UV,Events,year,month,day,dayofweek,Sales2
0,2022-01-01,22711525,397349,4421.0,1,2022,1,1,5,18169220.0
1,2022-01-02,36779,3969,2289.0,0,2022,1,2,6,36779.0
2,2022-01-03,13943875,373890,NaN,1,2022,1,3,0,11155100.0
3,2022-01-04,8088593,142054,2157.0,0,2022,1,4,1,8088593.0
4,2022-01-05,2395374,190684,NaN,0,2022,1,5,2,2395374.0

In [10]:
cond = df['year'] == 2022

df1 = df[cond]

sale1 = df1.groupby('month')['Sales2'].sum().max()
sale1

197145878.0

In [11]:
cond = df['year'] == 2023

df2 = df[cond]

sale2 = df2.groupby('month')['Sales2'].sum().max()

sale2

239619313.8

In [12]:
int(round(abs(sale1 - sale2),0))

42473436